my_dict = {"小明": {"语文": 77, "数学": 66, "英语": 33},
           "小红": {"语文": 88, "数学": 86, "英语": 55},
           "小亮": {"语文": 99, "数学": 96, "英语": 66}
           }
#
my_dict["小白"] = {"语文": 60, "数学": 70, "英语": 80}
#
print(my_dict["小白"]["数学"])




# 第一阶段-第六章-课后练习
comp_dict = {"王": {"部门": "科技部", "工资": 3000, "级别": 1},
             "周": {"部门": "市场部", "工资": 5000, "级别": 2},
             "林": {"部门": "市场部", "工资": 7000, "级别": 3},
             "张": {"部门": "科技部", "工资": 4000, "级别": 1},
             "刘": {"部门": "市场部", "工资": 6000, "级别": 2}
             }
print(f"全体员工当前信息如下：{comp_dict}")
# 首先遍历字典得到大key
for key in comp_dict:
    # 然后再通过遍历大key得到小key
    value = comp_dict[key]
    # 再对小key得到结果，对结果进行比对
    if value["级别"] == 1:
        # 得到需要改变的key，进行修改
        value["级别"] += 1
        value["工资"] += 1000

print(f"全体员工级别为1的员工完成升职加薪操作，操作后：{comp_dict}")